Repository: WahBun/AllYouNeedIsWheel
Catalog: ios/Wheel/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: Quantity
zh_hans: 数量
zh_hant: 數量

source: Quantity exceeds the configured order limit
zh_hans: 数量超出设定的订单上限
zh_hant: 數量超出設定的訂單上限

source: Quantity is locked; limit price and time in force remain editable.
zh_hans: 数量已锁定，仍可修改限价和有效期。
zh_hant: 數量已鎖定，仍可修改限價和有效期。

source: Quantity is the total, including fills. Only the unfilled remainder can change.
zh_hans: 数量包含已成交部分；修改仅影响未成交余量。
zh_hant: 數量包含已成交部分；修改僅影響未成交餘量。

source: Quantity must be a positive whole number
zh_hans: 数量必须为正整数
zh_hant: 數量必須為正整數

source: Quote
zh_hans: 报价
zh_hant: 報價

source: Quote expired or quantity changed. Refresh and review before staging.
zh_hans: 报价已过期或数量已变化，请刷新并核对后再提交。
zh_hant: 報價已過期或數量已變化，請重新整理並核對後再提交。

source: Quote not loaded
zh_hans: 报价尚未加载
zh_hant: 報價尚未載入

source: Quote refresh failed. The last quote is not current; staging is disabled.
zh_hans: 报价刷新失败，当前显示旧报价；暂时禁止提交。
zh_hant: 報價重新整理失敗，目前顯示舊報價；暫時禁止提交。

source: Random background
zh_hans: 随机背景
zh_hant: 隨機背景

source: Read-only mode: order modification is disabled
zh_hans: 只读模式：无法修改券商订单
zh_hant: 唯讀模式：無法修改券商訂單

source: Realized P&L
zh_hans: 已实现盈亏
zh_hant: 已實現損益

source: Reconciliation
zh_hans: 净值核对
zh_hant: 淨值核對

source: Reconnect Gateway
zh_hans: 重新登录 Gateway
zh_hant: 重新登錄 Gateway

source: Refresh
zh_hans: 刷新
zh_hant: 重新整理

source: Refresh both quotes
zh_hans: 刷新两腿报价
zh_hant: 重新整理兩腿報價

source: Refresh quote
zh_hans: 刷新报价
zh_hant: 重新整理報價

source: Remaining
zh_hans: 剩余数量
zh_hant: 剩餘數量

source: Remaining close quantity exceeds available holdings or covered-call reserves
zh_hans: 平仓余量超出可用持仓或占用了备兑所需股票
zh_hant: 平倉餘量超出可用持倉或佔用了備兌所需股票

source: Remote maintenance
zh_hans: 远程维护
zh_hant: 遠程維護

source: Remove
zh_hans: 移除
zh_hant: 移除

source: Report date
zh_hans: 报表日期

source: Reported return
zh_hans: 已结算收益率
zh_hant: 已結算報酬率

source: Reported shares
zh_hans: 报表股数

source: Request acknowledged. Refresh Orders to check broker status.
zh_hans: 请求已确认。请刷新订单，核对券商状态。
zh_hant: 請求已確認。請重新整理訂單，核對券商狀態。

source: Request failed.
zh_hans: 请求失败。
zh_hant: 請求失敗。

source: Restore default colors
zh_hans: 恢复默认颜色
zh_hant: 恢復默認顏色

source: Restore hidden opportunity tickers
zh_hans: 恢复隐藏的交易标的
zh_hant: 恢復隱藏的交易標的

source: Result unconfirmed. Verify in IB before another action.
zh_hans: 结果尚未确认，请先在 IB 核实，再执行其他操作。

source: Retrieved
zh_hans: 获取时间
zh_hant: 取得時間

source: Retry
zh_hans: 重试
zh_hant: 重試

source: Rollover
zh_hans: 展期
zh_hant: 展期

source: Rollover leg · independent order
zh_hans: 展期单腿 · 独立订单
zh_hant: 展期單腿 · 獨立訂單

source: Rollover quantity is locked to its paired leg
zh_hans: 移仓数量须与配对订单一致，已锁定
zh_hant: 轉倉數量須與配對訂單一致，已鎖定

source: Save changes
zh_hans: 保存修改
zh_hant: 儲存修改

source: Save price
zh_hans: 保存价格
zh_hant: 儲存價格

source: Save quantity
zh_hans: 保存数量
zh_hant: 儲存數量

source: Save your Mini HTTPS backend address in Settings first.
zh_hans: 请先在设置中保存 Mini 的 HTTPS 后端地址。
zh_hant: 請先在設置中保存 Mini 的 HTTPS 後端地址。

source: Scenario: close this entire holding while leaving all other positions unchanged.
zh_hans: 假设：平掉当前整笔持仓，其他持仓保持不变。
zh_hant: 假設：平掉目前整筆持倉，其他持倉保持不變。

source: Screen sharing
zh_hans: 屏幕共享
zh_hant: 屏幕共享

source: Secure connection failed (%@). Check Tailscale and open this exact HTTPS address in Safari on this iPhone. Verify automatic date/time and any VPN or proxy interference. Certificate checks remain enabled.
zh_hans: 安全连接失败（%@）。请检查 Tailscale，并在此 iPhone 的 Safari 中打开相同的 HTTPS 地址。检查自动日期与时间设置，以及 VPN 或代理是否干扰连接。证书验证仍保持启用。
zh_hant: 安全連接失敗（%@）。請檢查 Tailscale，並在此 iPhone 的 Safari 中打開相同的 HTTPS 地址。檢查自動日期與時間設置，以及 VPN 或代理是否干擾連接。證書驗證仍保持啓用。

source: Select date
zh_hans: 选择日期
zh_hant: 選擇日期

source: Selected contract unavailable. Refresh before staging.
zh_hans: 所选合约暂不可用，请刷新后再暂存订单。
zh_hant: 所選合約暫不可用，請刷新後再暫存訂單。

source: Selected-contract estimates
zh_hans: 所选合约估算
zh_hant: 所選合約估算

source: SELL TO OPEN
zh_hans: SELL TO OPEN · 卖出开仓
zh_hant: SELL TO OPEN · 賣出開倉

source: Sending request…
zh_hans: 正在发送请求…
zh_hant: 正在傳送請求…

source: Server snapshot
zh_hans: 服务端快照时间
zh_hant: 伺服器快照時間

source: Settings
zh_hans: 设置
zh_hant: 設定

source: Share holdings
zh_hans: 分享持仓
zh_hant: 分享持倉

source: Share image
zh_hans: 分享图片
zh_hant: 分享圖片

source: Short position not found.
zh_hans: 未找到对应的空头持仓。
zh_hant: 未找到對應的空頭持倉。

source: Short positions & negative cash
zh_hans: 空头持仓与负现金
zh_hant: 空頭持倉與負現金

source: Show liquidity and cash
zh_hans: 展开流动性和现金
zh_hant: 展開流動性和現金

source: Simulation only
zh_hans: 仅演示，不发送真实订单
zh_hant: 僅示範，不傳送真實訂單

source: Snapshot quote · verify before execution
zh_hans: 快照报价 · 执行前请核对
zh_hant: 快照報價 · 執行前請核對

source: Some market values are unavailable
zh_hans: 部分持仓市值暂不可用
zh_hant: 部分持倉市值暫不可用

source: Spread
zh_hans: 买卖价差
zh_hant: 買賣價差

source: Stage · Execute separately in Orders
zh_hans: 加入订单 · 在订单页单独执行
zh_hant: 加入訂單 · 在訂單頁單獨執行

source: Stage %lld %@ at %@ · %@?
zh_hans: 暂存 %lld 份 %@，限价 %@ · %@？
zh_hant: 暫存 %lld 份 %@，限價 %@ · %@？

source: Stage all (%@)
zh_hans: 全部暂存（%@）
zh_hant: 全部暫存（%@）

source: Stage close order
zh_hans: 加入平仓订单
zh_hant: 加入平倉訂單

source: Stage entry
zh_hans: 加入开仓订单
zh_hant: 加入開倉訂單

source: Stage pair
zh_hans: 加入两腿订单
zh_hant: 加入兩腿訂單

source: Stage rollover pair
zh_hans: 加入两腿展期订单
zh_hant: 加入兩腿展期訂單

source: Staged in Orders
zh_hans: 已加入订单
zh_hant: 已加入訂單

source: STALE
zh_hans: 数据待更新
zh_hant: 資料待更新

source: Status
zh_hans: 状态
zh_hant: 狀態

source: Stock price
zh_hans: 股价
zh_hant: 股價

source: Stock quotes unavailable
zh_hans: 暂时无法获取股票报价。
zh_hant: 暫時無法獲取股票報價。

source: Stocks
zh_hans: 股票
zh_hant: 股票

source: Strategy
zh_hans: 策略
zh_hant: 策略

source: Strike
zh_hans: 行权价
zh_hant: 履約價

source: System
zh_hans: 跟随系统
zh_hant: 跟隨系統

source: System color
zh_hans: 系统主色
zh_hant: 系統主色

source: The backend is reachable, but IB requests are busy. Allow automatic retries to back off. If this persists, check Mini and Gateway; this does not by itself mean Gateway disconnected.
zh_hans: 可以连接后端，但 IB 请求繁忙。请等待自动刷新退避重试；如果持续出现，请检查 Mini 和 Gateway。这并不直接代表 Gateway 已断开。

source: The time shown is the last successful backend refresh, not the exchange quote time.
zh_hans: 此处时间是上次成功刷新后端数据的时间，并非交易所报价时间。

source: Theme
zh_hans: 配色
zh_hant: 配色

source: Time in force
zh_hans: 有效期
zh_hant: 有效期

source: Today
zh_hans: 今日
zh_hant: 今日

source: Total
zh_hans: 合计
zh_hant: 合計

source: Total quantity must exceed already filled quantity; use Cancel for the remainder
zh_hans: 总数量必须大于已成交数量；如需停止余量，请撤单
zh_hant: 總數量必須大於已成交數量；如需停止餘量，請撤單

source: Total quantity: %lld
zh_hans: 总数量：%lld
zh_hant: 總數量：%lld

source: Trade
zh_hans: 交易
zh_hant: 交易

source: Trading access
zh_hans: 交易权限
zh_hant: 交易權限

source: Troubleshooting
zh_hans: 故障排查

source: Two independent orders, not an atomic spread. Close the old position and verify its fill before executing the new leg.
zh_hans: 这是两张独立订单，不是原子组合单。请先平掉旧仓并核对成交，再执行新仓。
zh_hant: 這是兩張獨立訂單，不是原子組合單。請先平掉舊倉並核對成交，再執行新倉。

source: Unable to import image
zh_hans: 无法导入图片
zh_hant: 無法導入圖片

source: Unconfirmed request
zh_hans: 请求结果待确认
zh_hant: 請求結果待確認

source: Unconfirmed request. Check IB and the web app before further trading.
zh_hans: 请求结果待确认。继续交易前，请先核对 IB 和网页版。
zh_hant: 請求結果待確認。繼續交易前，請先核對 IB 和網頁版。

source: Unrealized P&L
zh_hans: 未实现盈亏
zh_hant: 未實現損益

source: Unsupported rollover contract.
zh_hans: 不支持此移仓合约。
zh_hant: 不支持此移倉合約。

source: Update the backend to enable position margin estimates.
zh_hans: 请更新后端以启用持仓保证金估算。
zh_hant: 請更新後端以啟用持倉保證金估算。

source: Update the backend to use stock DAY or OVT orders.
zh_hans: 请更新后端后使用股票 DAY 或 OVT 订单。
zh_hant: 請更新後端後使用股票 DAY 或 OVT 訂單。

source: Use mid
zh_hans: 使用 Mid
zh_hant: 使用 Mid

source: Verified · unlock trading
zh_hans: 已核对 · 解除交易锁定
zh_hant: 已核對 · 解除交易鎖定

source: Version
zh_hans: 版本
zh_hant: 版本

source: Wall Street
zh_hans: 华尔街
zh_hant: 華爾街

source: Weights use absolute position values plus positive cash. Account details and amounts are hidden.
zh_hans: 比例按持仓市值绝对值及正现金计算。图片不展示账户信息和金额。
zh_hant: 比例按持倉市值絕對值及正現金計算。圖片不展示賬戶信息和金額。

source: Wheel does not store remote desktop or IB passwords.
zh_hans: Wheel 不保存远程桌面或 IB 密码。
zh_hant: Wheel 不保存遠程桌面或 IB 密碼。

source: YTD
zh_hans: 今年
zh_hant: 今年
